package C20230714;

//자료구조에 대한공부
//자료구조란? 자료구조는 데이터를 효율적으로 저장, 조직화, 관리, 처리하기 위한 방법이나 원리
/*선형 자료구조 (Linear Data Structures)
배열 (Array)
연결 리스트 (Linked List)
스택 (Stack)
큐 (Queue)

비선형 자료구조 (Non-linear Data Structures)
트리 (Tree)
그래프 (Graph)
파일 구조 (File Structures

순차 파일 (Sequential File)
색인 순차 파일 (Indexed Sequential File)
직접 접근 파일 (Direct Access File)

해시 테이블 (Hashing)
해시 함수 (Hash Function)
해시 테이블 (Hash Table)*/


//힙과 스택
//스택은 메모리의 한 부분으로서, 프로그램이 실행될 때 메서드 호출과 지역 변수 등을 저장하는데 사용
//스택은 후입선출(LIFO - Last-In-First-Out)의 구조를 가지고 있다
//가장 마지막에 저장된 데이터가 가장 먼저 제거된다
//메서드가 호출될 때 해당 메서드의 매개변수, 지역 변수, 리턴 값 등이 스택 프레임에 저장된다

//힙은 동적으로 할당된 객체들이 저장되는 영역
//객체는 new 키워드를 사용하여 동적으로 생성되며, 힙에 저장된다
//힙은 메모리의 다른 부분인 스택과 달리, 크기가 동적으로 조정
//힙은 가비지 컬렉션에 의해 관리되며 가비지는 더 이상 사용되지 않는 객체들을 자동으로 제거해 메모리 회수함
//힙은 객체의 생명주기를 제어하기 위해 사용되며, 직접 객체의 생성 및 소멸 시점을 명시적으로 제어할 필요없음

