package 이찬진;

public class C20230721 {

	public static void main(String[] args) {

		
		//문제1
		//프로그램이 실행되면, 변수는 주기억장치 중 ______에 할당됩니다.
		//가비지 컬렉터는 자바의 ______ 영역에 있는 객체들을 주로 관리합니다
		//변수의 이름과 같은 메모리 상에서 ______에 저장됩니다.
		//지역 변수는 해당 변수가 속한 ______ 내에서만 접근이 가능합니다.
		//자바에서는 사용하지 않는 메모리를 자동으로 회수하기 위해 _______라는 메커니즘이 존재합니다
		//자바에서 배열은 메모리 공간에 _______으로 저장됩니다.
		
		
		// 답 : 스택, 힙, 값, 블록, 가비지 컬렉션, 연속적
		
		//문제2
		//사각형의 넓이와 둘레를 구하는 문제
		//너비 12.5 높이 36.4를 변수에 저장하고, 각 넓이와 둘레를 계산해 변수에 담고
		//아래와 같이 출력 되도록 하세요.
		
		// -출력예시-
		//면적 : 455.0
		//둘레 : 97.8 

//			double a = 12.5;
//			double b = 36.4;
//			
//			double c = a*b;
//			double d = (a+b)*2;
//			
//			System.out.println("-출력예시-");
//			System.out.println("면적 : "+ c);
//			System.out.println("둘레 : "+ d);
	}

}
