package 윤광혁;

public class 예제20230718 {
	//1 선언문과 스크립틀릿
	//선언문
	//선언문은 JSP 페이지에 변수,메서드 또는 클레스를 선언하는데 사용된다.
	//선언문은 스크립틀릿처럼 <%%> 비슷하게 선언하지만 ! 이 들어가 <%! %>으로 선언한다.
	//선언문의 변수는 JSP 클레스의 맴버로 처리되므로 JSP 여러 영역에서 재사용 가능
	//선언문은 주로 메서드를 초기화 하거나 JSP 페이지에서 사용되는 유틸리티 메서드를 정의하는데 유용하다.
	//선언문 안에는 JAVA코드만 사용할수있다.
	
	//스크립틀릿
	//스크립틀릿은 JSP 페이지에서 JAVA코드를 실행하는대 사용된다
	//스크립틀릿은 <% %>방식으로 테그를 둘러 싼다.
	//스트립 틀릿은 JSP페이지 실행 영역에 속하며 HTML 출력을 생성하는대 사용한다.
	//스크립 틀릿 안에는 HAVA코드와 함께 HTML마크업도 사용가능하다.
	//스트립 틀릿은 동적으로 데이터를 처리하거나 조건문 ,반복문 등을 사용할떄 유용한다.
	
	//2 request
	//JSP에서 웹애플리케이션에서 클라이언트로 부터 받은 HTTP 요청에 대한 정보를 저장하고있는 객체이다.
	//request를 통해 클라이언트의 파라미터,헤더,쿠키 등의 정보를 읽을수있다.
	//서버로 데이터를 전송하는데에도 사용될수있다.
	//
	//보통 . 으로 코드 어시스트 를 통해 여러 연관 메서드를 볼수있다.
	//만약 코드 어시스트가 동작하지 않는다면 톰캣의 라이브러리 폴더안에 있는
	//서블릿 API JAR 파일을 다시 등록해주자.
	
	
	
	
}
